.. _nhs_userguide:

NHS Strings
============

Introduction
------------

The function :func:`clean_gb_nhs() <dataprep.clean.clean_gb_nhs.clean_gb_nhs>` cleans a column containing United Kingdom National Health Service patient identifier (NHS) strings, and standardizes them in a given format. The function :func:`validate_gb_nhs() <dataprep.clean.clean_gb_nhs.validate_gb_nhs>` validates either a single NHS strings, a column of NHS strings or a DataFrame of NHS strings, returning `True` if the value is valid, and `False` otherwise.

NHS strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "9434765870"
* `standard`: NHS strings with proper whitespace in the proper places, like "943 476 5870"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_gb_nhs()` and `validate_gb_nhs()`.

### An example dataset containing NHS strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nhs": [
            "9434765870",
            "9434765871",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              nhs                                           address
0      9434765870                                     123 Pine Ave.
1      9434765871                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_gb_nhs`

By default, `clean_gb_nhs` will clean nhs strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_gb_nhs
clean_gb_nhs(df, column = "nhs")

,nhs,address,nhs_clean
0,9434765870,123 Pine Ave.,943 476 5870
1,9434765871,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_gb_nhs(df, column = "nhs", output_format="standard")

,nhs,address,nhs_clean
0,9434765870,123 Pine Ave.,943 476 5870
1,9434765871,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_gb_nhs(df, column = "nhs", output_format="compact")

,nhs,address,nhs_clean
0,9434765870,123 Pine Ave.,9434765870
1,9434765871,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NHS strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_gb_nhs(df, column="nhs", inplace=True)

      nhs_clean                                           address
0  943 476 5870                                     123 Pine Ave.
1           NaN                                           main st
2           NaN                      1234 west main heights 57033
3           NaN                    apt 1 789 s maple rd manhattan
4           NaN                robie house, 789 north main street
5           NaN  (staples center) 1111 S Figueroa St, Los Angeles
6           NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_gb_nhs(df, "nhs", errors="coerce")

,nhs,address,nhs_clean
0,9434765870,123 Pine Ave.,943 476 5870
1,9434765871,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_gb_nhs(df, "nhs", errors="ignore")

,nhs,address,nhs_clean
0,9434765870,123 Pine Ave.,943 476 5870
1,9434765871,main st,9434765871
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_gb_nhs()`

`validate_gb_nhs()` returns `True` when the input is a valid NHS. Otherwise it returns `False`.

The input of `validate_gb_nhs()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_gb_nhs()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_gb_nhs()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_gb_nhs
print(validate_gb_nhs("9434765870"))
print(validate_gb_nhs("9434765871"))
print(validate_gb_nhs("51824753556"))
print(validate_gb_nhs("51 824 753 556"))
print(validate_gb_nhs("hello"))
print(validate_gb_nhs(np.nan))
print(validate_gb_nhs("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_gb_nhs(df["nhs"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nhs, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_gb_nhs(df, column="nhs")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nhs, dtype: bool

### Only DataFrame

In [11]:
validate_gb_nhs(df)

     nhs  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False